// Часть 1

let year = Number(prompt("Введіть рік народження:"));
let city = prompt("Введіть одне з трьох міст:", "Київ,Вашингтон,Лондон");
let sport = prompt("Введіть улюблений вид спорту:", "футбол,баскетбол,волейбол");

let age;
age = 2023 - year;


if (year > 2023 ) {
    alert(`Дуже смішно!`);
}
if (year < 1935 ) {
    alert(`Дуже смішно!`);
}
else {
    alert('Шкода, що Ви не захотіли ввести рік народження');
}

if (city == 'Київ') {
  alert(`Тобі: ${age}, ти живеш у столиці України!`);
} if (city == 'Вашингтон') {
    alert(`Тобі: ${age}, ти живеш у столиці США!`);
} if (city == 'Лондон') {
    alert(`Тобі: ${age}, ти живеш у столиці Англії!`);
}
else {
    alert('Шкода, що Ви не захотіли вибрати одне з трьох міст!');
}

if (sport == 'футбол') {
    alert(`Круто! Хочеш грати як Лео Мессі?`);
  } if (sport == 'баскетбол') {
      alert(`Круто! Хочеш робити данки як Леброн Джеймс?`);
  } if (sport == 'волейбол') {
      alert(`Круто! Хочеш стрибати так же високо як Юджі Нішіда?`);
  }
  else {
      alert('Шкода, що Ви не захотіли ввести свій(ю) вид спорту!');
  }




